export const TAGS = [
  {
    title: "何から手を着けていいのか分からないときは",
    slug: "getting_started",
    content:
      "『デザイニングWebアクセシビリティ』が手元にないという方は、今すぐ用意しましょう（？）",
  },
  {
    title: "Webアクセシビリティとは？的なもの",
    slug: "introduction_to_web_accessibility",
    content: "Webにおけるアクセシビリティを知りましょう。",
  },
  {
    title: "企業がWebアクセシビリティに取り組む価値",
    slug: "company_effort",
    content:
      "企業が取り組む意味はどこにあるのか、なぜいま始める必要があるのかといった観点を解説しています。",
  },
  {
    title: "Web制作者がWebアクセシビリティに取り組む価値",
    slug: "personal_effort",
    content:
      "Webという場を活かすことと非常に親しい関係にあるWebアクセシビリティは、Web制作者が取り組むに値する活動だと言えます。",
  },
  {
    title: "企業ごとのやっていきの表明",
    slug: "company_announcement",
    content:
      "ウェブサービス事業会社、ウェブ制作会社のアクセシビリティへの取り組みを紹介したページを集めました。",
  },
  {
    title: "組織導入に奮闘している事例",
    slug: "case_study",
    content:
      "実際の現場で取り組んでいる例。どうすればあなたの職場でアクセシビリティの取り組みを回すことができるようになるのかの参考になるかもしれません。",
  },
  {
    title: "海外の動き",
    slug: "overseas_trends",
    content:
      "WCAG 2.1がW3Cの勧告となり、これをベースに法整備しようという動きがEUではあるらしいです。その一方で、米国はようやくWCAG 2.0を取り込んだ法律ができたそうで、各国の事情はさまざまなようです。",
  },
  {
    title: "障害当事者の声とか使い方",
    slug: "users_voice",
    content:
      "ユーザーに向き合うためには、どのような使い方をしているのかを知る必要があります。また、障害者といってもさまざまで、実に個性があふれます。例えば目の障害があるからといって、まったく視力を失っているとは限らないのです。",
  },
  {
    title: "WCAGやJISの読み方",
    slug: "instruction_of_specs",
    content:
      "WCAG 2.0なり、JIS X 8341:2016をさあやろう！という意気込みはいいですが、ガイドラインは非常に抽象的なので、関連文書を抑えることが望ましいでしょう（わかるところから攻めていく）。",
  },
  {
    title: "啓発ツール",
    slug: "awareness_tool",
    content:
      "アクセシビリティとは何かを概観できるポスターなど。組織内やチーム内での意思統一に活用しましょう。",
  },
  {
    title: "ガイドラインのチートシート",
    slug: "cheet_sheet_of_guidelines",
    content: "達成基準の番号なんて覚えられないですよね。",
  },
  {
    title: "WAICのガイドライン系",
    slug: "waic_guidelines",
    content:
      "ウェブアクセシビリティ基盤委員会では、JIS X 8341-3:2016の附属書JAに基づいた方針策定ガイドラインや、附属書JBに基づく試験実施ガイドライン、そのほか対応度表記や発注のガイドラインなどを取り揃えています。きちんとした手続きに則って対応を進めるときでも、フランクに進めるときでも、一度眺めておくと参考になるでしょう。",
  },
  {
    title: "インクルーシブデザイン",
    slug: "inclusive_design",
    content:
      "アクセシビリティと共に取り沙汰されることの多い「インクルーシブデザイン」。その語の指す意味や、デザインプロセスなどについて解説。",
  },
  {
    title: "要件定義",
    slug: "requirement_difinition",
    content:
      "ウェブサイトを受発注するときに検討される要件定義。この段階でアクセシビリティに気をつける観点とは何か。",
  },
  {
    title: "文字サイズ変更機能・読み上げ機能・配色変更機能・スキップリンク",
    slug: "assistance_by_website",
    content:
      "コンテンツ側でこういう機能を実装すべきなのか、なぜ実装されるのか、やる場合の要件は何なのか、具体例の調査など。",
  },
  {
    title: "情報設計・ライティング",
    slug: "ia_writting",
    content:
      "ナビゲーションデザインやラベリングやライティングなど、情報を探し出して理解できるようにする観点と、アクセシビリティとの関わりについて。",
  },
  {
    title: "alt（代替テキスト）",
    slug: "alt",
    content:
      "アクセシビリティを考えるうえで、最も基本的なものとされる代替テキスト。考え方や書き方、具体例の紹介や失敗例など。",
  },
  {
    title: "ビジュアルデザイン",
    slug: "vd",
    content:
      "視覚的なデザインにおけるアクセシビリティ。コントラストの話やカラーユニバーサルデザインの話から、それらの関係性、さらには色に頼らない設計なども。",
  },
  {
    title: "HTML＋CSS＋JS",
    slug: "html_css_js",
    content:
      "いわゆるフロントエンド実装におけるアクセシビリティの確保について。全体的な考え方から、細かいTipsまでいろいろあります。",
  },
  {
    title: "WAI-ARIA",
    slug: "wai_aria",
    content:
      "とくにJavaScriptと協調して動作させるときに真価を発揮します。WAI-ARIA仕様は1.2の策定が開始されました。まだまだ発展途上の仕様と言え、最新の情報を追いかけることが求められます。",
  },
  {
    title: "SVG",
    slug: "svg",
    content:
      "実はテキストでありコードであるSVGは、画像をアクセシブルにするという観点でも重要な存在です。",
  },
  {
    title: "アイコンフォント",
    slug: "icon_font",
    content:
      "アイコンフォント、空の要素として置いて、そこをクリックしてメニューを出したり、マウスオーバーでヘルプとか出してしまいがち。それ実はアウトです的な話など。",
  },
  {
    title: "PDF",
    slug: "pdf",
    content:
      "ウェブコンテンツとして一般的なPDFですが、そのアクセシビリティについてはあまり知られていないようです。どのようなアプローチがあり得るのでしょうか。",
  },
  {
    title: "電子書籍（EPUB）",
    slug: "epub",
    content:
      "EPUBの中身はHTMLであり、ウェブページのアクセシビリティの考え方の多くが流用できます。ウェブをアクセシブルにできる人は、電子書籍もアクセシブルにできるのです。",
  },
  {
    title: "動画",
    slug: "video",
    content:
      "動画をアクセシブルにする方法の代表例は字幕。その字幕やキャプションをどのように作るか、どのように動画に設定するか、それによってどのような効果が生まれるか。",
  },
  {
    title: "AT（支援技術）の使い方などに関するリソース",
    slug: "at",
    content: "スクリーンリーダーに触れることが一番多いかと思います。",
  },
  {
    title: "AS（アクセシビリティサポーテッド情報）",
    slug: "as",
    content:
      "包括的なリソースは残念ながら存在しない（caniuseのアクセシビリティ版みたいなのは残念ながらない）ので、究極的には自分でテストしないといけない可能性が…。",
  },
  {
    title: "失敗事例集",
    slug: "mistake",
    content:
      "手付かずの状態のときにありがちな失敗と、アクセシビリティやる気を出したときにおこりがちな失敗と。セットで読むと趣があります。",
  },
  {
    title: "ネイティブアプリ",
    slug: "native_app",
    content:
      "OSネイティブのアクセシビリティオブジェクトを意識するのが肝のようです。日本語の情報がかなり少ないので、見つかったものは割と全部載せてます。",
  },
  {
    title: "CMS",
    slug: "cms",
    content:
      "アクセシビリティを維持するには運用が重要。アクセシブルな仕組みをCMSで構築できれば、そのウェブサイトの品質維持に大きく貢献します。",
  },
  {
    title: "運用プロセス",
    slug: "operation",
    content:
      "（この話題、日本語リソースだとあんまり見かけない。どなたか追記希望!）",
  },
  {
    title: "会社・団体の独自ガイドライン",
    slug: "guidelines_in_company",
    content:
      "WCAGやJISなどの公式ガイドラインを自分ごとに置き換えて読むために。自社の事例を交えつつサマリーを作成した事例の紹介。",
  },
  {
    title: "チェックツール（コントラスト）",
    slug: "color_check_tool",
    content:
      "人間だけですべてチェックすると大変ですから、機械の力も借りましょう。",
  },
  {
    title: "チェックツール（障害のシミュレーション）",
    slug: "simulation_tool",
    content: "おもに色の見え方の違いをシミュレーションするツールの紹介。",
  },
  {
    title: "チェックツール（HTML＋CSS）",
    slug: "code_check_tool",
    content:
      "ブラウザ上でレンダリングされたHTML＋CSSがアクセシブルなものであるかを自動チェックしてくれるツールの紹介。",
  },
  {
    title: "チェック自動化（タスクランナー、CI、E2E）",
    slug: "automation_tool",
    content:
      "自動チェックを開発プロセスに組み込むことで、確実にチェックと修正を実施することができます。",
  },
  {
    title: "Q&A",
    slug: "q_and_a",
    content:
      "ピンポイントな疑問でも、Q&Aを漁ってみるとバッチリ合う回答があるかもしれません。",
  },
  {
    title: "公式仕様および和訳",
    slug: "official_specs",
    content:
      "意外と知られてなかったり、和訳されていることが伝わってないものもあるかも。",
  },
  {
    title: "おもしろ動画・音楽",
    slug: "fun_art",
    content:
      "やっている本人はウケ狙いもしてますが、思いの外に真剣だったりします。",
  },
  {
    title: "アクセシビリティ関連イベントの一覧",
    slug: "events",
    content:
      "アクセシビリティについて扱いがあったイベントがまとめられているウェブサイトの紹介。",
  },
];

export const CONSTANTS = {
  SITE_DESC: "Webアクセシビリティの参考資料まとめ",
  SITE_NAME: "accrefs",
  SITE_ORIGIN: "https://accrefs.jp",
  TAGS,
};
